podonoghue/usbdm-firmware/BootLoopMKE/Project_Headers/MKE02Z16M4.h
/****************************************************************************************************//**
 * @file     MKE02Z16M4.h
 *
 * @brief    CMSIS Cortex-M Peripheral Access Layer Header File for MKE02Z4.
 *           Equivalent: MKE02Z64M4, FRDM_KE02Z40M, MKE02Z32M4, MKE02Z16M4
 *
 * @version  V0.0
 * @date     2015/07
 *
 *******************************************************************************************************/

#ifndef MCU_MKE02Z4
#define MCU_MKE02Z4

#include <stdint.h>
#ifdef __cplusplus
extern "C" {
#endif

/**
* @addtogroup Interrupt_vector_numbers_GROUP Interrupt vector numbers
* @brief Vector numbers required for NVIC functions
* @{
*/
/* -------------------------  Interrupt Number Definition  ------------------------ */

/**
 * Interrupt vector numbers
 */
typedef enum {
/* ------------------------  Processor Exceptions Numbers  ------------------------- */
  Reset_IRQn                    = -15,   /**<   1 Reset Vector, invoked on Power up and warm reset                                 */
  NonMaskableInt_IRQn           = -14,   /**<   2 Non maskable Interrupt, cannot be stopped or preempted                           */
  HardFault_IRQn                = -13,   /**<   3 Hard Fault, all classes of Fault                                                 */
  SVCall_IRQn                   =  -5,   /**<  11 System Service Call via SVC instruction                                          */
  PendSV_IRQn                   =  -2,   /**<  14 Pendable request for system service                                              */
  SysTick_IRQn                  =  -1,   /**<  15 System Tick Timer                                                                */
/* ----------------------   MKE02Z2 VectorTable                      ---------------------- */
  FTMRH_IRQn                    =   5,   /**<  21 FTMRH Command complete or error                                                  */
  PMC_IRQn                      =   6,   /**<  22 PMC Low-voltage detect, low-voltage warning                                      */
  IRQ_IRQn                      =   7,   /**<  23 External Interrupt                                                               */
  I2C0_IRQn                     =   8,   /**<  24 I2C Interface 0                                                                  */
  SPI0_IRQn                     =  10,   /**<  26 Serial Peripheral Interface 0                                                    */
  SPI1_IRQn                     =  11,   /**<  27 Serial Peripheral Interface 1                                                    */
  UART0_IRQn                    =  12,   /**<  28 UART0 Status and error                                                           */
  UART1_IRQn                    =  13,   /**<  29 UART1 Status and error                                                           */
  UART2_IRQn                    =  14,   /**<  30 UART2 Status and error                                                           */
  ADC0_IRQn                     =  15,   /**<  31 Analogue to Digital Converter 0                                                  */
  ACMP0_IRQn                    =  16,   /**<  32 Analogue comparator 0                                                            */
  FTM0_IRQn                     =  17,   /**<  33 Flexible Timer Module 0                                                          */
  FTM1_IRQn                     =  18,   /**<  34 Flexible Timer Module 1                                                          */
  FTM2_IRQn                     =  19,   /**<  35 Flexible Timer Module 2                                                          */
  RTC_IRQn                      =  20,   /**<  36 Real Time Clock overflow                                                         */
  ACMP1_IRQn                    =  21,   /**<  37 Analogue comparator 0                                                            */
  PIT_CH0_IRQn                  =  22,   /**<  38 Programmable Interrupt Timer Channel 0                                           */
  PIT_CH1_IRQn                  =  23,   /**<  39 Programmable Interrupt Timer Channel 1                                           */
  KBI0_IRQn                     =  24,   /**<  40 Keyboard Interrupt 0                                                             */
  KBI1_IRQn                     =  25,   /**<  41 Keyboard Interrupt 1                                                             */
  ICS_IRQn                      =  27,   /**<  43 ICS                                                                              */
  WDOG_IRQn                     =  28,   /**<  44 Watch dog                                                                        */
} IRQn_Type;

/**
 * @} */ /* End group Interrupt_vector_numbers_GROUP 
 */
/**
* @addtogroup Interrupt_handler_prototypes_GROUP Interrupt handler prototypes
* @brief Prototypes for interrupt handlers
* @{
*/
/* -------------------------  Exception Handlers  ------------------------ */
extern void NMI_Handler(void);                 /**< Non maskable Interrupt, cannot be stopped or preempted                           */
extern void HardFault_Handler(void);           /**< Hard Fault, all classes of Fault                                                 */
extern void SVC_Handler(void);                 /**< System Service Call via SVC instruction                                          */
extern void PendSV_Handler(void);              /**< Pendable request for system service                                              */
extern void SysTick_Handler(void);             /**< System Tick Timer                                                                */
extern void FTMRH_IRQHandler(void);            /**< FTMRH Command complete or error                                                  */
extern void PMC_IRQHandler(void);              /**< PMC Low-voltage detect, low-voltage warning                                      */
extern void IRQ_IRQHandler(void);              /**< External Interrupt                                                               */
extern void I2C0_IRQHandler(void);             /**< I2C Interface 0                                                                  */
extern void SPI0_IRQHandler(void);             /**< Serial Peripheral Interface 0                                                    */
extern void SPI1_IRQHandler(void);             /**< Serial Peripheral Interface 1                                                    */
extern void UART0_IRQHandler(void);            /**< UART0 Status and error                                                           */
extern void UART1_IRQHandler(void);            /**< UART1 Status and error                                                           */
extern void UART2_IRQHandler(void);            /**< UART2 Status and error                                                           */
extern void ADC0_IRQHandler(void);             /**< Analogue to Digital Converter 0                                                  */
extern void ACMP0_IRQHandler(void);            /**< Analogue comparator 0                                                            */
extern void FTM0_IRQHandler(void);             /**< Flexible Timer Module 0                                                          */
extern void FTM1_IRQHandler(void);             /**< Flexible Timer Module 1                                                          */
extern void FTM2_IRQHandler(void);             /**< Flexible Timer Module 2                                                          */
extern void RTC_IRQHandler(void);              /**< Real Time Clock overflow                                                         */
extern void ACMP1_IRQHandler(void);            /**< Analogue comparator 0                                                            */
extern void PIT_CH0_IRQHandler(void);          /**< Programmable Interrupt Timer Channel 0                                           */
extern void PIT_CH1_IRQHandler(void);          /**< Programmable Interrupt Timer Channel 1                                           */
extern void KBI0_IRQHandler(void);             /**< Keyboard Interrupt 0                                                             */
extern void KBI1_IRQHandler(void);             /**< Keyboard Interrupt 1                                                             */
extern void ICS_IRQHandler(void);              /**< ICS                                                                              */
extern void WDOG_IRQHandler(void);             /**< Watch dog                                                                        */

/**
 * @} */ /* End group Interrupt_handler_prototypes_GROUP 
 */
/* ================================================================================ */
/* ================      Processor and Core Peripheral Section     ================ */
/* ================================================================================ */

/**
* @addtogroup Cortex_Core_Configuration_GROUP Cortex Core Configuration
* @brief Configuration of the cm4 Processor and Core Peripherals
* @{
*/
#define __CM0PLUS_REV             0x0100     /**< CPU Revision                                        */
#define __MPU_PRESENT             0          /**< Whether MPU is present                              */
#define __NVIC_PRIO_BITS          2          /**< Number of implemented bits in NVIC PRIO register    */
#define __Vendor_SysTickConfig    0          /**< Whether Vendor implemented SYSTICK timer is present */
#define __FPU_PRESENT             0          /**< Whether FPU is present                              */
#define __VTOR_PRESENT            1          /**< Whether VTOR register is present                    */

/**
 * @} */ /* End group Cortex_Core_Configuration_GROUP 
 */
#include "core_cm0plus.h"       /* Processor and core peripherals     */
#include "system.h"             /* Device specific configuration file */

#ifndef __IO
#define __IO volatile 
#endif

#ifndef __I
#define __I volatile const
#endif

