podonoghue/usbdm-firmware/BootLoopMKE/Project_Headers/MKE02Z16M4.h
#ifndef __O
#define __O volatile
#endif


/* ================================================================================ */
/* ================       Device Specific Peripheral Section       ================ */
/* ================================================================================ */



/* -------------------  Start of section using anonymous unions  ------------------ */
#if defined(__CC_ARM)
  #pragma push
  #pragma anon_unions
#elif defined(__ICCARM__)
  #pragma language=extended
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__TMS470__)
/* anonymous unions are enabled by default */
#elif defined(__TASKING__)
  #pragma warning 586
#else
  #warning Not supported compiler type
#endif
/**
* @addtogroup Peripheral_access_layer_GROUP Device Peripheral Access Layer
* @brief C structs allowing access to peripheral registers
* @{
*/
/**
* @addtogroup ACMP_Peripheral_access_layer_GROUP ACMP Peripheral Access Layer
* @brief C Struct for ACMP
* @{
*/

/* ================================================================================ */
/* ================           ACMP0 (file:ACMP0_MKE)               ================ */
/* ================================================================================ */

/**
 * @brief Analog comparator
 */
/**
* @addtogroup ACMP_structs_GROUP ACMP struct
* @brief Struct for ACMP
* @{
*/
typedef struct {                                /*       ACMP0 Structure                                              */
   __IO uint8_t   CS;                           /**< 0000: ACMP Control and Status Register                             */
   __IO uint8_t   C0;                           /**< 0001: ACMP Control Register 0                                      */
   __IO uint8_t   C1;                           /**< 0002: ACMP Control Register 1                                      */
   __IO uint8_t   C2;                           /**< 0003: ACMP Control Register 2                                      */
} ACMP_Type;

/**
 * @} */ /* End group ACMP_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'ACMP0' Position & Mask macros                       ----------- */
/* -------------------------------------------------------------------------------- */

/**
* @addtogroup ACMP_Register_Masks_GROUP ACMP Register Masks
* @brief Register Masks for ACMP
* @{
*/
/* ------- CS Bit Fields                            ------ */
#define ACMP_CS_ACMOD_MASK                       (0x03UL << ACMP_CS_ACMOD_SHIFT)                     /*!< ACMP0_CS: ACMOD Mask                    */
#define ACMP_CS_ACMOD_SHIFT                      0                                                   /*!< ACMP0_CS: ACMOD Position                */
#define ACMP_CS_ACMOD(x)                         (((uint8_t)(((uint8_t)(x))<<ACMP_CS_ACMOD_SHIFT))&ACMP_CS_ACMOD_MASK) /*!< ACMP0_CS                                */
#define ACMP_CS_ACOPE_MASK                       (0x01UL << ACMP_CS_ACOPE_SHIFT)                     /*!< ACMP0_CS: ACOPE Mask                    */
#define ACMP_CS_ACOPE_SHIFT                      2                                                   /*!< ACMP0_CS: ACOPE Position                */
#define ACMP_CS_ACO_MASK                         (0x01UL << ACMP_CS_ACO_SHIFT)                       /*!< ACMP0_CS: ACO Mask                      */
#define ACMP_CS_ACO_SHIFT                        3                                                   /*!< ACMP0_CS: ACO Position                  */
#define ACMP_CS_ACIE_MASK                        (0x01UL << ACMP_CS_ACIE_SHIFT)                      /*!< ACMP0_CS: ACIE Mask                     */
#define ACMP_CS_ACIE_SHIFT                       4                                                   /*!< ACMP0_CS: ACIE Position                 */
#define ACMP_CS_ACF_MASK                         (0x01UL << ACMP_CS_ACF_SHIFT)                       /*!< ACMP0_CS: ACF Mask                      */
#define ACMP_CS_ACF_SHIFT                        5                                                   /*!< ACMP0_CS: ACF Position                  */
#define ACMP_CS_HYST_MASK                        (0x01UL << ACMP_CS_HYST_SHIFT)                      /*!< ACMP0_CS: HYST Mask                     */
#define ACMP_CS_HYST_SHIFT                       6                                                   /*!< ACMP0_CS: HYST Position                 */
#define ACMP_CS_ACE_MASK                         (0x01UL << ACMP_CS_ACE_SHIFT)                       /*!< ACMP0_CS: ACE Mask                      */
#define ACMP_CS_ACE_SHIFT                        7                                                   /*!< ACMP0_CS: ACE Position                  */
/* ------- C0 Bit Fields                            ------ */
#define ACMP_C0_ACNSEL_MASK                      (0x03UL << ACMP_C0_ACNSEL_SHIFT)                    /*!< ACMP0_C0: ACNSEL Mask                   */
#define ACMP_C0_ACNSEL_SHIFT                     0                                                   /*!< ACMP0_C0: ACNSEL Position               */
#define ACMP_C0_ACNSEL(x)                        (((uint8_t)(((uint8_t)(x))<<ACMP_C0_ACNSEL_SHIFT))&ACMP_C0_ACNSEL_MASK) /*!< ACMP0_C0                                */
#define ACMP_C0_ACPSEL_MASK                      (0x03UL << ACMP_C0_ACPSEL_SHIFT)                    /*!< ACMP0_C0: ACPSEL Mask                   */
#define ACMP_C0_ACPSEL_SHIFT                     4                                                   /*!< ACMP0_C0: ACPSEL Position               */
#define ACMP_C0_ACPSEL(x)                        (((uint8_t)(((uint8_t)(x))<<ACMP_C0_ACPSEL_SHIFT))&ACMP_C0_ACPSEL_MASK) /*!< ACMP0_C0                                */
/* ------- C1 Bit Fields                            ------ */
#define ACMP_C1_DACVAL_MASK                      (0x3FUL << ACMP_C1_DACVAL_SHIFT)                    /*!< ACMP0_C1: DACVAL Mask                   */
#define ACMP_C1_DACVAL_SHIFT                     0                                                   /*!< ACMP0_C1: DACVAL Position               */
#define ACMP_C1_DACVAL(x)                        (((uint8_t)(((uint8_t)(x))<<ACMP_C1_DACVAL_SHIFT))&ACMP_C1_DACVAL_MASK) /*!< ACMP0_C1                                */
#define ACMP_C1_DACREF_MASK                      (0x01UL << ACMP_C1_DACREF_SHIFT)                    /*!< ACMP0_C1: DACREF Mask                   */
#define ACMP_C1_DACREF_SHIFT                     6                                                   /*!< ACMP0_C1: DACREF Position               */
#define ACMP_C1_DACEN_MASK                       (0x01UL << ACMP_C1_DACEN_SHIFT)                     /*!< ACMP0_C1: DACEN Mask                    */
#define ACMP_C1_DACEN_SHIFT                      7                                                   /*!< ACMP0_C1: DACEN Position                */
/* ------- C2 Bit Fields                            ------ */
#define ACMP_C2_ACIPE_MASK                       (0x07UL << ACMP_C2_ACIPE_SHIFT)                     /*!< ACMP0_C2: ACIPE Mask                    */
#define ACMP_C2_ACIPE_SHIFT                      0                                                   /*!< ACMP0_C2: ACIPE Position                */
#define ACMP_C2_ACIPE(x)                         (((uint8_t)(((uint8_t)(x))<<ACMP_C2_ACIPE_SHIFT))&ACMP_C2_ACIPE_MASK) /*!< ACMP0_C2                                */
/**
 * @} */ /* End group ACMP_Register_Masks_GROUP 
 */

