podonoghue/usbdm-firmware/BootLoopMKE/Project_Headers/MKE02Z16M4.h
#define FTM_SWOCTRL_CH3OC_SHIFT                  3                                                   /*!< FTM2_SWOCTRL: CH3OC Position            */
#define FTM_SWOCTRL_CH4OC_MASK                   (0x01UL << FTM_SWOCTRL_CH4OC_SHIFT)                 /*!< FTM2_SWOCTRL: CH4OC Mask                */
#define FTM_SWOCTRL_CH4OC_SHIFT                  4                                                   /*!< FTM2_SWOCTRL: CH4OC Position            */
#define FTM_SWOCTRL_CH5OC_MASK                   (0x01UL << FTM_SWOCTRL_CH5OC_SHIFT)                 /*!< FTM2_SWOCTRL: CH5OC Mask                */
#define FTM_SWOCTRL_CH5OC_SHIFT                  5                                                   /*!< FTM2_SWOCTRL: CH5OC Position            */
#define FTM_SWOCTRL_CH6OC_MASK                   (0x01UL << FTM_SWOCTRL_CH6OC_SHIFT)                 /*!< FTM2_SWOCTRL: CH6OC Mask                */
#define FTM_SWOCTRL_CH6OC_SHIFT                  6                                                   /*!< FTM2_SWOCTRL: CH6OC Position            */
#define FTM_SWOCTRL_CH7OC_MASK                   (0x01UL << FTM_SWOCTRL_CH7OC_SHIFT)                 /*!< FTM2_SWOCTRL: CH7OC Mask                */
#define FTM_SWOCTRL_CH7OC_SHIFT                  7                                                   /*!< FTM2_SWOCTRL: CH7OC Position            */
#define FTM_SWOCTRL_CH0OCV_MASK                  (0x01UL << FTM_SWOCTRL_CH0OCV_SHIFT)                /*!< FTM2_SWOCTRL: CH0OCV Mask               */
#define FTM_SWOCTRL_CH0OCV_SHIFT                 8                                                   /*!< FTM2_SWOCTRL: CH0OCV Position           */
#define FTM_SWOCTRL_CH1OCV_MASK                  (0x01UL << FTM_SWOCTRL_CH1OCV_SHIFT)                /*!< FTM2_SWOCTRL: CH1OCV Mask               */
#define FTM_SWOCTRL_CH1OCV_SHIFT                 9                                                   /*!< FTM2_SWOCTRL: CH1OCV Position           */
#define FTM_SWOCTRL_CH2OCV_MASK                  (0x01UL << FTM_SWOCTRL_CH2OCV_SHIFT)                /*!< FTM2_SWOCTRL: CH2OCV Mask               */
#define FTM_SWOCTRL_CH2OCV_SHIFT                 10                                                  /*!< FTM2_SWOCTRL: CH2OCV Position           */
#define FTM_SWOCTRL_CH3OCV_MASK                  (0x01UL << FTM_SWOCTRL_CH3OCV_SHIFT)                /*!< FTM2_SWOCTRL: CH3OCV Mask               */
#define FTM_SWOCTRL_CH3OCV_SHIFT                 11                                                  /*!< FTM2_SWOCTRL: CH3OCV Position           */
#define FTM_SWOCTRL_CH4OCV_MASK                  (0x01UL << FTM_SWOCTRL_CH4OCV_SHIFT)                /*!< FTM2_SWOCTRL: CH4OCV Mask               */
#define FTM_SWOCTRL_CH4OCV_SHIFT                 12                                                  /*!< FTM2_SWOCTRL: CH4OCV Position           */
#define FTM_SWOCTRL_CH5OCV_MASK                  (0x01UL << FTM_SWOCTRL_CH5OCV_SHIFT)                /*!< FTM2_SWOCTRL: CH5OCV Mask               */
#define FTM_SWOCTRL_CH5OCV_SHIFT                 13                                                  /*!< FTM2_SWOCTRL: CH5OCV Position           */
#define FTM_SWOCTRL_CH6OCV_MASK                  (0x01UL << FTM_SWOCTRL_CH6OCV_SHIFT)                /*!< FTM2_SWOCTRL: CH6OCV Mask               */
#define FTM_SWOCTRL_CH6OCV_SHIFT                 14                                                  /*!< FTM2_SWOCTRL: CH6OCV Position           */
#define FTM_SWOCTRL_CH7OCV_MASK                  (0x01UL << FTM_SWOCTRL_CH7OCV_SHIFT)                /*!< FTM2_SWOCTRL: CH7OCV Mask               */
#define FTM_SWOCTRL_CH7OCV_SHIFT                 15                                                  /*!< FTM2_SWOCTRL: CH7OCV Position           */
/* ------- PWMLOAD Bit Fields                       ------ */
#define FTM_PWMLOAD_CH0SEL_MASK                  (0x01UL << FTM_PWMLOAD_CH0SEL_SHIFT)                /*!< FTM2_PWMLOAD: CH0SEL Mask               */
#define FTM_PWMLOAD_CH0SEL_SHIFT                 0                                                   /*!< FTM2_PWMLOAD: CH0SEL Position           */
#define FTM_PWMLOAD_CH1SEL_MASK                  (0x01UL << FTM_PWMLOAD_CH1SEL_SHIFT)                /*!< FTM2_PWMLOAD: CH1SEL Mask               */
#define FTM_PWMLOAD_CH1SEL_SHIFT                 1                                                   /*!< FTM2_PWMLOAD: CH1SEL Position           */
#define FTM_PWMLOAD_CH2SEL_MASK                  (0x01UL << FTM_PWMLOAD_CH2SEL_SHIFT)                /*!< FTM2_PWMLOAD: CH2SEL Mask               */
#define FTM_PWMLOAD_CH2SEL_SHIFT                 2                                                   /*!< FTM2_PWMLOAD: CH2SEL Position           */
#define FTM_PWMLOAD_CH3SEL_MASK                  (0x01UL << FTM_PWMLOAD_CH3SEL_SHIFT)                /*!< FTM2_PWMLOAD: CH3SEL Mask               */
#define FTM_PWMLOAD_CH3SEL_SHIFT                 3                                                   /*!< FTM2_PWMLOAD: CH3SEL Position           */
#define FTM_PWMLOAD_CH4SEL_MASK                  (0x01UL << FTM_PWMLOAD_CH4SEL_SHIFT)                /*!< FTM2_PWMLOAD: CH4SEL Mask               */
#define FTM_PWMLOAD_CH4SEL_SHIFT                 4                                                   /*!< FTM2_PWMLOAD: CH4SEL Position           */
#define FTM_PWMLOAD_CH5SEL_MASK                  (0x01UL << FTM_PWMLOAD_CH5SEL_SHIFT)                /*!< FTM2_PWMLOAD: CH5SEL Mask               */
#define FTM_PWMLOAD_CH5SEL_SHIFT                 5                                                   /*!< FTM2_PWMLOAD: CH5SEL Position           */
#define FTM_PWMLOAD_CH6SEL_MASK                  (0x01UL << FTM_PWMLOAD_CH6SEL_SHIFT)                /*!< FTM2_PWMLOAD: CH6SEL Mask               */
#define FTM_PWMLOAD_CH6SEL_SHIFT                 6                                                   /*!< FTM2_PWMLOAD: CH6SEL Position           */
#define FTM_PWMLOAD_CH7SEL_MASK                  (0x01UL << FTM_PWMLOAD_CH7SEL_SHIFT)                /*!< FTM2_PWMLOAD: CH7SEL Mask               */
#define FTM_PWMLOAD_CH7SEL_SHIFT                 7                                                   /*!< FTM2_PWMLOAD: CH7SEL Position           */
#define FTM_PWMLOAD_LDOK_MASK                    (0x01UL << FTM_PWMLOAD_LDOK_SHIFT)                  /*!< FTM2_PWMLOAD: LDOK Mask                 */
#define FTM_PWMLOAD_LDOK_SHIFT                   9                                                   /*!< FTM2_PWMLOAD: LDOK Position             */
/**
 * @} */ /* End group FTM_Register_Masks_GROUP 
 */

/* FTM2 - Peripheral instance base addresses */
#define FTM2_BasePtr                   0x4003A000UL //!< Peripheral base address
#define FTM2                           ((FTM_Type *) FTM2_BasePtr) //!< Freescale base pointer
#define FTM2_BASE_PTR                  (FTM2) //!< Freescale style base pointer
/**
 * @} */ /* End group FTM_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup FTMRH_Peripheral_access_layer_GROUP FTMRH Peripheral Access Layer
* @brief C Struct for FTMRH
* @{
*/

/* ================================================================================ */
/* ================           FTMRH (file:FTMRH)                   ================ */
/* ================================================================================ */

/**
 * @brief Flash Memory Interface
 */
/**
* @addtogroup FTMRH_structs_GROUP FTMRH struct
* @brief Struct for FTMRH
* @{
*/
typedef struct {                                /*       FTMRH Structure                                              */
   __IO uint8_t   FCLKDIV;                      /**< 0000: Flash Clock Divider Register                                 */
   __I  uint8_t   FSEC;                         /**< 0001: Flash Security Register                                      */
   __IO uint8_t   FCCOBIX;                      /**< 0002: Flash CCOB Index Register                                    */
   __I  uint8_t   RESERVED0;                   
   __IO uint8_t   FCNFG;                        /**< 0004: Flash Configuration Register                                 */
   __IO uint8_t   FERCNFG;                      /**< 0005: Flash Error Configuration Register                           */
   __IO uint8_t   FSTAT;                        /**< 0006: Flash Status Register                                        */
   __IO uint8_t   FERSTAT;                      /**< 0007: Flash Error Status Register                                  */
   __IO uint8_t   FPROT;                        /**< 0008: Flash Protection Register                                    */
   __IO uint8_t   EEPROT;                       /**< 0009: EEPROM Protection Register                                   */
   union {                                      /**< 0000: (size=0002)                                                  */
      __IO uint16_t  FCCOB;                     /**< 000A: Flash Common Command Object Register (FCCOBLO:FCCOBHI)       */
      struct {                                  /**< 0000: (size=0002)                                                  */
         __IO uint8_t   FCCOBHI;                /**< 000A: Flash Common Command Object Register:High                    */
         __IO uint8_t   FCCOBLO;                /**< 000B: Flash Common Command Object Register:Low                     */
      };
   };
   __I  uint8_t   FOPT;                         /**< 000C: Flash Option Register                                        */
} FTMRH_Type;

/**
 * @} */ /* End group FTMRH_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'FTMRH' Position & Mask macros                       ----------- */
/* -------------------------------------------------------------------------------- */

/**
* @addtogroup FTMRH_Register_Masks_GROUP FTMRH Register Masks
* @brief Register Masks for FTMRH
* @{
*/
/* ------- FCLKDIV Bit Fields                       ------ */
#define FTMRH_FCLKDIV_FDIV_MASK                  (0x3FUL << FTMRH_FCLKDIV_FDIV_SHIFT)                /*!< FTMRH_FCLKDIV: FDIV Mask                */
#define FTMRH_FCLKDIV_FDIV_SHIFT                 0                                                   /*!< FTMRH_FCLKDIV: FDIV Position            */
#define FTMRH_FCLKDIV_FDIV(x)                    (((uint8_t)(((uint8_t)(x))<<FTMRH_FCLKDIV_FDIV_SHIFT))&FTMRH_FCLKDIV_FDIV_MASK) /*!< FTMRH_FCLKDIV                           */
#define FTMRH_FCLKDIV_FDIVLCK_MASK               (0x01UL << FTMRH_FCLKDIV_FDIVLCK_SHIFT)             /*!< FTMRH_FCLKDIV: FDIVLCK Mask             */
#define FTMRH_FCLKDIV_FDIVLCK_SHIFT              6                                                   /*!< FTMRH_FCLKDIV: FDIVLCK Position         */
#define FTMRH_FCLKDIV_FDIVLD_MASK                (0x01UL << FTMRH_FCLKDIV_FDIVLD_SHIFT)              /*!< FTMRH_FCLKDIV: FDIVLD Mask              */
#define FTMRH_FCLKDIV_FDIVLD_SHIFT               7                                                   /*!< FTMRH_FCLKDIV: FDIVLD Position          */
/* ------- FSEC Bit Fields                          ------ */
#define FTMRH_FSEC_SEC_MASK                      (0x03UL << FTMRH_FSEC_SEC_SHIFT)                    /*!< FTMRH_FSEC: SEC Mask                    */
#define FTMRH_FSEC_SEC_SHIFT                     0                                                   /*!< FTMRH_FSEC: SEC Position                */
#define FTMRH_FSEC_SEC(x)                        (((uint8_t)(((uint8_t)(x))<<FTMRH_FSEC_SEC_SHIFT))&FTMRH_FSEC_SEC_MASK) /*!< FTMRH_FSEC                              */
#define FTMRH_FSEC_KEYEN_MASK                    (0x03UL << FTMRH_FSEC_KEYEN_SHIFT)                  /*!< FTMRH_FSEC: KEYEN Mask                  */
#define FTMRH_FSEC_KEYEN_SHIFT                   6                                                   /*!< FTMRH_FSEC: KEYEN Position              */
#define FTMRH_FSEC_KEYEN(x)                      (((uint8_t)(((uint8_t)(x))<<FTMRH_FSEC_KEYEN_SHIFT))&FTMRH_FSEC_KEYEN_MASK) /*!< FTMRH_FSEC                              */
/* ------- FCCOBIX Bit Fields                       ------ */
#define FTMRH_FCCOBIX_CCOBIX_MASK                (0x07UL << FTMRH_FCCOBIX_CCOBIX_SHIFT)              /*!< FTMRH_FCCOBIX: CCOBIX Mask              */
#define FTMRH_FCCOBIX_CCOBIX_SHIFT               0                                                   /*!< FTMRH_FCCOBIX: CCOBIX Position          */
#define FTMRH_FCCOBIX_CCOBIX(x)                  (((uint8_t)(((uint8_t)(x))<<FTMRH_FCCOBIX_CCOBIX_SHIFT))&FTMRH_FCCOBIX_CCOBIX_MASK) /*!< FTMRH_FCCOBIX                           */
/* ------- FCNFG Bit Fields                         ------ */
#define FTMRH_FCNFG_FSFD_MASK                    (0x01UL << FTMRH_FCNFG_FSFD_SHIFT)                  /*!< FTMRH_FCNFG: FSFD Mask                  */
#define FTMRH_FCNFG_FSFD_SHIFT                   0                                                   /*!< FTMRH_FCNFG: FSFD Position              */
#define FTMRH_FCNFG_FDFD_MASK                    (0x01UL << FTMRH_FCNFG_FDFD_SHIFT)                  /*!< FTMRH_FCNFG: FDFD Mask                  */
#define FTMRH_FCNFG_FDFD_SHIFT                   1                                                   /*!< FTMRH_FCNFG: FDFD Position              */
#define FTMRH_FCNFG_IGNSF_MASK                   (0x01UL << FTMRH_FCNFG_IGNSF_SHIFT)                 /*!< FTMRH_FCNFG: IGNSF Mask                 */
#define FTMRH_FCNFG_IGNSF_SHIFT                  4                                                   /*!< FTMRH_FCNFG: IGNSF Position             */
#define FTMRH_FCNFG_CCIE_MASK                    (0x01UL << FTMRH_FCNFG_CCIE_SHIFT)                  /*!< FTMRH_FCNFG: CCIE Mask                  */
#define FTMRH_FCNFG_CCIE_SHIFT                   7                                                   /*!< FTMRH_FCNFG: CCIE Position              */
/* ------- FERCNFG Bit Fields                       ------ */
#define FTMRH_FERCNFG_SFDIE_MASK                 (0x01UL << FTMRH_FERCNFG_SFDIE_SHIFT)               /*!< FTMRH_FERCNFG: SFDIE Mask               */
#define FTMRH_FERCNFG_SFDIE_SHIFT                0                                                   /*!< FTMRH_FERCNFG: SFDIE Position           */
#define FTMRH_FERCNFG_DFDIE_MASK                 (0x01UL << FTMRH_FERCNFG_DFDIE_SHIFT)               /*!< FTMRH_FERCNFG: DFDIE Mask               */
#define FTMRH_FERCNFG_DFDIE_SHIFT                1                                                   /*!< FTMRH_FERCNFG: DFDIE Position           */
/* ------- FSTAT Bit Fields                         ------ */
#define FTMRH_FSTAT_MGSTAT_MASK                  (0x03UL << FTMRH_FSTAT_MGSTAT_SHIFT)                /*!< FTMRH_FSTAT: MGSTAT Mask                */
#define FTMRH_FSTAT_MGSTAT_SHIFT                 0                                                   /*!< FTMRH_FSTAT: MGSTAT Position            */
#define FTMRH_FSTAT_MGSTAT(x)                    (((uint8_t)(((uint8_t)(x))<<FTMRH_FSTAT_MGSTAT_SHIFT))&FTMRH_FSTAT_MGSTAT_MASK) /*!< FTMRH_FSTAT                             */
#define FTMRH_FSTAT_MGBUSY_MASK                  (0x01UL << FTMRH_FSTAT_MGBUSY_SHIFT)                /*!< FTMRH_FSTAT: MGBUSY Mask                */
#define FTMRH_FSTAT_MGBUSY_SHIFT                 3                                                   /*!< FTMRH_FSTAT: MGBUSY Position            */
#define FTMRH_FSTAT_FPVIOL_MASK                  (0x01UL << FTMRH_FSTAT_FPVIOL_SHIFT)                /*!< FTMRH_FSTAT: FPVIOL Mask                */
#define FTMRH_FSTAT_FPVIOL_SHIFT                 4                                                   /*!< FTMRH_FSTAT: FPVIOL Position            */
#define FTMRH_FSTAT_ACCERR_MASK                  (0x01UL << FTMRH_FSTAT_ACCERR_SHIFT)                /*!< FTMRH_FSTAT: ACCERR Mask                */
#define FTMRH_FSTAT_ACCERR_SHIFT                 5                                                   /*!< FTMRH_FSTAT: ACCERR Position            */
#define FTMRH_FSTAT_CCIF_MASK                    (0x01UL << FTMRH_FSTAT_CCIF_SHIFT)                  /*!< FTMRH_FSTAT: CCIF Mask                  */
#define FTMRH_FSTAT_CCIF_SHIFT                   7                                                   /*!< FTMRH_FSTAT: CCIF Position              */
/* ------- FERSTAT Bit Fields                       ------ */
#define FTMRH_FERSTAT_SFDIF_MASK                 (0x01UL << FTMRH_FERSTAT_SFDIF_SHIFT)               /*!< FTMRH_FERSTAT: SFDIF Mask               */
#define FTMRH_FERSTAT_SFDIF_SHIFT                0                                                   /*!< FTMRH_FERSTAT: SFDIF Position           */
#define FTMRH_FERSTAT_DFDIF_MASK                 (0x01UL << FTMRH_FERSTAT_DFDIF_SHIFT)               /*!< FTMRH_FERSTAT: DFDIF Mask               */
#define FTMRH_FERSTAT_DFDIF_SHIFT                1                                                   /*!< FTMRH_FERSTAT: DFDIF Position           */
/* ------- FPROT Bit Fields                         ------ */
#define FTMRH_FPROT_FPLS_MASK                    (0x03UL << FTMRH_FPROT_FPLS_SHIFT)                  /*!< FTMRH_FPROT: FPLS Mask                  */
#define FTMRH_FPROT_FPLS_SHIFT                   0                                                   /*!< FTMRH_FPROT: FPLS Position              */
#define FTMRH_FPROT_FPLS(x)                      (((uint8_t)(((uint8_t)(x))<<FTMRH_FPROT_FPLS_SHIFT))&FTMRH_FPROT_FPLS_MASK) /*!< FTMRH_FPROT                             */
#define FTMRH_FPROT_FPLDIS_MASK                  (0x01UL << FTMRH_FPROT_FPLDIS_SHIFT)                /*!< FTMRH_FPROT: FPLDIS Mask                */
#define FTMRH_FPROT_FPLDIS_SHIFT                 2                                                   /*!< FTMRH_FPROT: FPLDIS Position            */
#define FTMRH_FPROT_FPHS_MASK                    (0x03UL << FTMRH_FPROT_FPHS_SHIFT)                  /*!< FTMRH_FPROT: FPHS Mask                  */
#define FTMRH_FPROT_FPHS_SHIFT                   3                                                   /*!< FTMRH_FPROT: FPHS Position              */
#define FTMRH_FPROT_FPHS(x)                      (((uint8_t)(((uint8_t)(x))<<FTMRH_FPROT_FPHS_SHIFT))&FTMRH_FPROT_FPHS_MASK) /*!< FTMRH_FPROT                             */
#define FTMRH_FPROT_FPHDIS_MASK                  (0x01UL << FTMRH_FPROT_FPHDIS_SHIFT)                /*!< FTMRH_FPROT: FPHDIS Mask                */
#define FTMRH_FPROT_FPHDIS_SHIFT                 5                                                   /*!< FTMRH_FPROT: FPHDIS Position            */
#define FTMRH_FPROT_FPOPEN_MASK                  (0x01UL << FTMRH_FPROT_FPOPEN_SHIFT)                /*!< FTMRH_FPROT: FPOPEN Mask                */
#define FTMRH_FPROT_FPOPEN_SHIFT                 7                                                   /*!< FTMRH_FPROT: FPOPEN Position            */
/* ------- EEPROT Bit Fields                        ------ */
#define FTMRH_EEPROT_DPS_MASK                    (0x07UL << FTMRH_EEPROT_DPS_SHIFT)                  /*!< FTMRH_EEPROT: DPS Mask                  */
#define FTMRH_EEPROT_DPS_SHIFT                   0                                                   /*!< FTMRH_EEPROT: DPS Position              */
#define FTMRH_EEPROT_DPS(x)                      (((uint8_t)(((uint8_t)(x))<<FTMRH_EEPROT_DPS_SHIFT))&FTMRH_EEPROT_DPS_MASK) /*!< FTMRH_EEPROT                            */
#define FTMRH_EEPROT_DPOPEN_MASK                 (0x01UL << FTMRH_EEPROT_DPOPEN_SHIFT)               /*!< FTMRH_EEPROT: DPOPEN Mask               */
#define FTMRH_EEPROT_DPOPEN_SHIFT                7                                                   /*!< FTMRH_EEPROT: DPOPEN Position           */
/* ------- FCCOB Bit Fields                         ------ */
/* ------- FCCOBHI Bit Fields                       ------ */
/* ------- FCCOBLO Bit Fields                       ------ */
/* ------- FOPT Bit Fields                          ------ */
/**
 * @} */ /* End group FTMRH_Register_Masks_GROUP 
 */

/* FTMRH - Peripheral instance base addresses */
#define FTMRH_BasePtr                  0x40020000UL //!< Peripheral base address
#define FTMRH                          ((FTMRH_Type *) FTMRH_BasePtr) //!< Freescale base pointer
#define FTMRH_BASE_PTR                 (FTMRH) //!< Freescale style base pointer
/**
 * @} */ /* End group FTMRH_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup FGPIOA_Peripheral_access_layer_GROUP FGPIOA Peripheral Access Layer
* @brief C Struct for FGPIOA
* @{
*/

/* ================================================================================ */
/* ================           GPIOA (derived from FGPIOA)          ================ */
/* ================================================================================ */

/**
 * @brief General Purpose Input/Output
 */

/* GPIOA - Peripheral instance base addresses */
#define GPIOA_BasePtr                  0x400FF000UL //!< Peripheral base address
#define GPIOA                          ((GPIO_Type *) GPIOA_BasePtr) //!< Freescale base pointer
#define GPIOA_BASE_PTR                 (GPIOA) //!< Freescale style base pointer
/**
 * @} */ /* End group FGPIOA_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup FGPIOB_Peripheral_access_layer_GROUP FGPIOB Peripheral Access Layer
* @brief C Struct for FGPIOB
* @{
*/

/* ================================================================================ */
/* ================           GPIOB (derived from FGPIOB)          ================ */
/* ================================================================================ */

/**
 * @brief General Purpose Input/Output
 */

/* GPIOB - Peripheral instance base addresses */
#define GPIOB_BasePtr                  0x400FF040UL //!< Peripheral base address
#define GPIOB                          ((FGPIOB_Type *) GPIOB_BasePtr) //!< Freescale base pointer
#define GPIOB_BASE_PTR                 (GPIOB) //!< Freescale style base pointer
/**
 * @} */ /* End group FGPIOB_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup I2C_Peripheral_access_layer_GROUP I2C Peripheral Access Layer
* @brief C Struct for I2C
* @{
*/

/* ================================================================================ */
/* ================           I2C0 (file:I2C0_MKE)                 ================ */
/* ================================================================================ */

