podonoghue/usbdm-firmware/BootLoopMKE/Project_Headers/MKE02Z16M4.h
/**
* @addtogroup PORT_Register_Masks_GROUP PORT Register Masks
* @brief Register Masks for PORT
* @{
*/
/* ------- IOFLT Bit Fields                         ------ */
#define PORT_IOFLT_FLTA_MASK                     (0x03UL << PORT_IOFLT_FLTA_SHIFT)                   /*!< PORT_IOFLT: FLTA Mask                   */
#define PORT_IOFLT_FLTA_SHIFT                    0                                                   /*!< PORT_IOFLT: FLTA Position               */
#define PORT_IOFLT_FLTA(x)                       (((uint32_t)(((uint32_t)(x))<<PORT_IOFLT_FLTA_SHIFT))&PORT_IOFLT_FLTA_MASK) /*!< PORT_IOFLT                              */
#define PORT_IOFLT_FLTB_MASK                     (0x03UL << PORT_IOFLT_FLTB_SHIFT)                   /*!< PORT_IOFLT: FLTB Mask                   */
#define PORT_IOFLT_FLTB_SHIFT                    2                                                   /*!< PORT_IOFLT: FLTB Position               */
#define PORT_IOFLT_FLTB(x)                       (((uint32_t)(((uint32_t)(x))<<PORT_IOFLT_FLTB_SHIFT))&PORT_IOFLT_FLTB_MASK) /*!< PORT_IOFLT                              */
#define PORT_IOFLT_FLTC_MASK                     (0x03UL << PORT_IOFLT_FLTC_SHIFT)                   /*!< PORT_IOFLT: FLTC Mask                   */
#define PORT_IOFLT_FLTC_SHIFT                    4                                                   /*!< PORT_IOFLT: FLTC Position               */
#define PORT_IOFLT_FLTC(x)                       (((uint32_t)(((uint32_t)(x))<<PORT_IOFLT_FLTC_SHIFT))&PORT_IOFLT_FLTC_MASK) /*!< PORT_IOFLT                              */
#define PORT_IOFLT_FLTD_MASK                     (0x03UL << PORT_IOFLT_FLTD_SHIFT)                   /*!< PORT_IOFLT: FLTD Mask                   */
#define PORT_IOFLT_FLTD_SHIFT                    6                                                   /*!< PORT_IOFLT: FLTD Position               */
#define PORT_IOFLT_FLTD(x)                       (((uint32_t)(((uint32_t)(x))<<PORT_IOFLT_FLTD_SHIFT))&PORT_IOFLT_FLTD_MASK) /*!< PORT_IOFLT                              */
#define PORT_IOFLT_FLTE_MASK                     (0x03UL << PORT_IOFLT_FLTE_SHIFT)                   /*!< PORT_IOFLT: FLTE Mask                   */
#define PORT_IOFLT_FLTE_SHIFT                    8                                                   /*!< PORT_IOFLT: FLTE Position               */
#define PORT_IOFLT_FLTE(x)                       (((uint32_t)(((uint32_t)(x))<<PORT_IOFLT_FLTE_SHIFT))&PORT_IOFLT_FLTE_MASK) /*!< PORT_IOFLT                              */
#define PORT_IOFLT_FLTF_MASK                     (0x03UL << PORT_IOFLT_FLTF_SHIFT)                   /*!< PORT_IOFLT: FLTF Mask                   */
#define PORT_IOFLT_FLTF_SHIFT                    10                                                  /*!< PORT_IOFLT: FLTF Position               */
#define PORT_IOFLT_FLTF(x)                       (((uint32_t)(((uint32_t)(x))<<PORT_IOFLT_FLTF_SHIFT))&PORT_IOFLT_FLTF_MASK) /*!< PORT_IOFLT                              */
#define PORT_IOFLT_FLTG_MASK                     (0x03UL << PORT_IOFLT_FLTG_SHIFT)                   /*!< PORT_IOFLT: FLTG Mask                   */
#define PORT_IOFLT_FLTG_SHIFT                    12                                                  /*!< PORT_IOFLT: FLTG Position               */
#define PORT_IOFLT_FLTG(x)                       (((uint32_t)(((uint32_t)(x))<<PORT_IOFLT_FLTG_SHIFT))&PORT_IOFLT_FLTG_MASK) /*!< PORT_IOFLT                              */
#define PORT_IOFLT_FLTH_MASK                     (0x03UL << PORT_IOFLT_FLTH_SHIFT)                   /*!< PORT_IOFLT: FLTH Mask                   */
#define PORT_IOFLT_FLTH_SHIFT                    14                                                  /*!< PORT_IOFLT: FLTH Position               */
#define PORT_IOFLT_FLTH(x)                       (((uint32_t)(((uint32_t)(x))<<PORT_IOFLT_FLTH_SHIFT))&PORT_IOFLT_FLTH_MASK) /*!< PORT_IOFLT                              */
#define PORT_IOFLT_FLTRST_MASK                   (0x03UL << PORT_IOFLT_FLTRST_SHIFT)                 /*!< PORT_IOFLT: FLTRST Mask                 */
#define PORT_IOFLT_FLTRST_SHIFT                  16                                                  /*!< PORT_IOFLT: FLTRST Position             */
#define PORT_IOFLT_FLTRST(x)                     (((uint32_t)(((uint32_t)(x))<<PORT_IOFLT_FLTRST_SHIFT))&PORT_IOFLT_FLTRST_MASK) /*!< PORT_IOFLT                              */
#define PORT_IOFLT_FLTKBI0_MASK                  (0x03UL << PORT_IOFLT_FLTKBI0_SHIFT)                /*!< PORT_IOFLT: FLTKBI0 Mask                */
#define PORT_IOFLT_FLTKBI0_SHIFT                 18                                                  /*!< PORT_IOFLT: FLTKBI0 Position            */
#define PORT_IOFLT_FLTKBI0(x)                    (((uint32_t)(((uint32_t)(x))<<PORT_IOFLT_FLTKBI0_SHIFT))&PORT_IOFLT_FLTKBI0_MASK) /*!< PORT_IOFLT                              */
#define PORT_IOFLT_FLTKBI1_MASK                  (0x03UL << PORT_IOFLT_FLTKBI1_SHIFT)                /*!< PORT_IOFLT: FLTKBI1 Mask                */
#define PORT_IOFLT_FLTKBI1_SHIFT                 20                                                  /*!< PORT_IOFLT: FLTKBI1 Position            */
#define PORT_IOFLT_FLTKBI1(x)                    (((uint32_t)(((uint32_t)(x))<<PORT_IOFLT_FLTKBI1_SHIFT))&PORT_IOFLT_FLTKBI1_MASK) /*!< PORT_IOFLT                              */
#define PORT_IOFLT_FLTNMI_MASK                   (0x03UL << PORT_IOFLT_FLTNMI_SHIFT)                 /*!< PORT_IOFLT: FLTNMI Mask                 */
#define PORT_IOFLT_FLTNMI_SHIFT                  22                                                  /*!< PORT_IOFLT: FLTNMI Position             */
#define PORT_IOFLT_FLTNMI(x)                     (((uint32_t)(((uint32_t)(x))<<PORT_IOFLT_FLTNMI_SHIFT))&PORT_IOFLT_FLTNMI_MASK) /*!< PORT_IOFLT                              */
#define PORT_IOFLT_FLTDIV1_MASK                  (0x03UL << PORT_IOFLT_FLTDIV1_SHIFT)                /*!< PORT_IOFLT: FLTDIV1 Mask                */
#define PORT_IOFLT_FLTDIV1_SHIFT                 24                                                  /*!< PORT_IOFLT: FLTDIV1 Position            */
#define PORT_IOFLT_FLTDIV1(x)                    (((uint32_t)(((uint32_t)(x))<<PORT_IOFLT_FLTDIV1_SHIFT))&PORT_IOFLT_FLTDIV1_MASK) /*!< PORT_IOFLT                              */
#define PORT_IOFLT_FLTDIV2_MASK                  (0x07UL << PORT_IOFLT_FLTDIV2_SHIFT)                /*!< PORT_IOFLT: FLTDIV2 Mask                */
#define PORT_IOFLT_FLTDIV2_SHIFT                 26                                                  /*!< PORT_IOFLT: FLTDIV2 Position            */
#define PORT_IOFLT_FLTDIV2(x)                    (((uint32_t)(((uint32_t)(x))<<PORT_IOFLT_FLTDIV2_SHIFT))&PORT_IOFLT_FLTDIV2_MASK) /*!< PORT_IOFLT                              */
#define PORT_IOFLT_FLTDIV3_MASK                  (0x07UL << PORT_IOFLT_FLTDIV3_SHIFT)                /*!< PORT_IOFLT: FLTDIV3 Mask                */
#define PORT_IOFLT_FLTDIV3_SHIFT                 29                                                  /*!< PORT_IOFLT: FLTDIV3 Position            */
#define PORT_IOFLT_FLTDIV3(x)                    (((uint32_t)(((uint32_t)(x))<<PORT_IOFLT_FLTDIV3_SHIFT))&PORT_IOFLT_FLTDIV3_MASK) /*!< PORT_IOFLT                              */
/* ------- PUEL Bit Fields                          ------ */
#define PORT_PUEL_PTAPE_MASK                     (0xFFUL << PORT_PUEL_PTAPE_SHIFT)                   /*!< PORT_PUEL: PTAPE Mask                   */
#define PORT_PUEL_PTAPE_SHIFT                    0                                                   /*!< PORT_PUEL: PTAPE Position               */
#define PORT_PUEL_PTAPE(x)                       (((uint32_t)(((uint32_t)(x))<<PORT_PUEL_PTAPE_SHIFT))&PORT_PUEL_PTAPE_MASK) /*!< PORT_PUEL                               */
#define PORT_PUEL_PTBPE_MASK                     (0xFFUL << PORT_PUEL_PTBPE_SHIFT)                   /*!< PORT_PUEL: PTBPE Mask                   */
#define PORT_PUEL_PTBPE_SHIFT                    8                                                   /*!< PORT_PUEL: PTBPE Position               */
#define PORT_PUEL_PTBPE(x)                       (((uint32_t)(((uint32_t)(x))<<PORT_PUEL_PTBPE_SHIFT))&PORT_PUEL_PTBPE_MASK) /*!< PORT_PUEL                               */
#define PORT_PUEL_PTCPE_MASK                     (0xFFUL << PORT_PUEL_PTCPE_SHIFT)                   /*!< PORT_PUEL: PTCPE Mask                   */
#define PORT_PUEL_PTCPE_SHIFT                    16                                                  /*!< PORT_PUEL: PTCPE Position               */
#define PORT_PUEL_PTCPE(x)                       (((uint32_t)(((uint32_t)(x))<<PORT_PUEL_PTCPE_SHIFT))&PORT_PUEL_PTCPE_MASK) /*!< PORT_PUEL                               */
#define PORT_PUEL_PTDPE_MASK                     (0xFFUL << PORT_PUEL_PTDPE_SHIFT)                   /*!< PORT_PUEL: PTDPE Mask                   */
#define PORT_PUEL_PTDPE_SHIFT                    24                                                  /*!< PORT_PUEL: PTDPE Position               */
#define PORT_PUEL_PTDPE(x)                       (((uint32_t)(((uint32_t)(x))<<PORT_PUEL_PTDPE_SHIFT))&PORT_PUEL_PTDPE_MASK) /*!< PORT_PUEL                               */
/* ------- PUEH Bit Fields                          ------ */
#define PORT_PUEH_PTEPE_MASK                     (0xFFUL << PORT_PUEH_PTEPE_SHIFT)                   /*!< PORT_PUEH: PTEPE Mask                   */
#define PORT_PUEH_PTEPE_SHIFT                    0                                                   /*!< PORT_PUEH: PTEPE Position               */
#define PORT_PUEH_PTEPE(x)                       (((uint32_t)(((uint32_t)(x))<<PORT_PUEH_PTEPE_SHIFT))&PORT_PUEH_PTEPE_MASK) /*!< PORT_PUEH                               */
#define PORT_PUEH_PTFPE_MASK                     (0xFFUL << PORT_PUEH_PTFPE_SHIFT)                   /*!< PORT_PUEH: PTFPE Mask                   */
#define PORT_PUEH_PTFPE_SHIFT                    8                                                   /*!< PORT_PUEH: PTFPE Position               */
#define PORT_PUEH_PTFPE(x)                       (((uint32_t)(((uint32_t)(x))<<PORT_PUEH_PTFPE_SHIFT))&PORT_PUEH_PTFPE_MASK) /*!< PORT_PUEH                               */
#define PORT_PUEH_PTGPE_MASK                     (0xFFUL << PORT_PUEH_PTGPE_SHIFT)                   /*!< PORT_PUEH: PTGPE Mask                   */
#define PORT_PUEH_PTGPE_SHIFT                    16                                                  /*!< PORT_PUEH: PTGPE Position               */
#define PORT_PUEH_PTGPE(x)                       (((uint32_t)(((uint32_t)(x))<<PORT_PUEH_PTGPE_SHIFT))&PORT_PUEH_PTGPE_MASK) /*!< PORT_PUEH                               */
#define PORT_PUEH_PTHPE_MASK                     (0xFFUL << PORT_PUEH_PTHPE_SHIFT)                   /*!< PORT_PUEH: PTHPE Mask                   */
#define PORT_PUEH_PTHPE_SHIFT                    24                                                  /*!< PORT_PUEH: PTHPE Position               */
#define PORT_PUEH_PTHPE(x)                       (((uint32_t)(((uint32_t)(x))<<PORT_PUEH_PTHPE_SHIFT))&PORT_PUEH_PTHPE_MASK) /*!< PORT_PUEH                               */
/* ------- HDRVE Bit Fields                         ------ */
#define PORT_HDRVE_PTB4_MASK                     (0x01UL << PORT_HDRVE_PTB4_SHIFT)                   /*!< PORT_HDRVE: PTB4 Mask                   */
#define PORT_HDRVE_PTB4_SHIFT                    0                                                   /*!< PORT_HDRVE: PTB4 Position               */
#define PORT_HDRVE_PTB5_MASK                     (0x01UL << PORT_HDRVE_PTB5_SHIFT)                   /*!< PORT_HDRVE: PTB5 Mask                   */
#define PORT_HDRVE_PTB5_SHIFT                    1                                                   /*!< PORT_HDRVE: PTB5 Position               */
#define PORT_HDRVE_PTD0_MASK                     (0x01UL << PORT_HDRVE_PTD0_SHIFT)                   /*!< PORT_HDRVE: PTD0 Mask                   */
#define PORT_HDRVE_PTD0_SHIFT                    2                                                   /*!< PORT_HDRVE: PTD0 Position               */
#define PORT_HDRVE_PTD1_MASK                     (0x01UL << PORT_HDRVE_PTD1_SHIFT)                   /*!< PORT_HDRVE: PTD1 Mask                   */
#define PORT_HDRVE_PTD1_SHIFT                    3                                                   /*!< PORT_HDRVE: PTD1 Position               */
#define PORT_HDRVE_PTE0_MASK                     (0x01UL << PORT_HDRVE_PTE0_SHIFT)                   /*!< PORT_HDRVE: PTE0 Mask                   */
#define PORT_HDRVE_PTE0_SHIFT                    4                                                   /*!< PORT_HDRVE: PTE0 Position               */
#define PORT_HDRVE_PTE1_MASK                     (0x01UL << PORT_HDRVE_PTE1_SHIFT)                   /*!< PORT_HDRVE: PTE1 Mask                   */
#define PORT_HDRVE_PTE1_SHIFT                    5                                                   /*!< PORT_HDRVE: PTE1 Position               */
#define PORT_HDRVE_PTH0_MASK                     (0x01UL << PORT_HDRVE_PTH0_SHIFT)                   /*!< PORT_HDRVE: PTH0 Mask                   */
#define PORT_HDRVE_PTH0_SHIFT                    6                                                   /*!< PORT_HDRVE: PTH0 Position               */
#define PORT_HDRVE_PTH1_MASK                     (0x01UL << PORT_HDRVE_PTH1_SHIFT)                   /*!< PORT_HDRVE: PTH1 Mask                   */
#define PORT_HDRVE_PTH1_SHIFT                    7                                                   /*!< PORT_HDRVE: PTH1 Position               */
/**
 * @} */ /* End group PORT_Register_Masks_GROUP 
 */

