podonoghue/usbdm-firmware/BootLoopMKE/Project_Headers/MKE02Z16M4.h
/**
* @addtogroup SIM_Register_Masks_GROUP SIM Register Masks
* @brief Register Masks for SIM
* @{
*/
/* ------- SRSID Bit Fields                         ------ */
#define SIM_SRSID_LVD_MASK                       (0x01UL << SIM_SRSID_LVD_SHIFT)                     /*!< SIM_SRSID: LVD Mask                     */
#define SIM_SRSID_LVD_SHIFT                      1                                                   /*!< SIM_SRSID: LVD Position                 */
#define SIM_SRSID_LOC_MASK                       (0x01UL << SIM_SRSID_LOC_SHIFT)                     /*!< SIM_SRSID: LOC Mask                     */
#define SIM_SRSID_LOC_SHIFT                      2                                                   /*!< SIM_SRSID: LOC Position                 */
#define SIM_SRSID_WDOG_MASK                      (0x01UL << SIM_SRSID_WDOG_SHIFT)                    /*!< SIM_SRSID: WDOG Mask                    */
#define SIM_SRSID_WDOG_SHIFT                     5                                                   /*!< SIM_SRSID: WDOG Position                */
#define SIM_SRSID_PIN_MASK                       (0x01UL << SIM_SRSID_PIN_SHIFT)                     /*!< SIM_SRSID: PIN Mask                     */
#define SIM_SRSID_PIN_SHIFT                      6                                                   /*!< SIM_SRSID: PIN Position                 */
#define SIM_SRSID_POR_MASK                       (0x01UL << SIM_SRSID_POR_SHIFT)                     /*!< SIM_SRSID: POR Mask                     */
#define SIM_SRSID_POR_SHIFT                      7                                                   /*!< SIM_SRSID: POR Position                 */
#define SIM_SRSID_LOCKUP_MASK                    (0x01UL << SIM_SRSID_LOCKUP_SHIFT)                  /*!< SIM_SRSID: LOCKUP Mask                  */
#define SIM_SRSID_LOCKUP_SHIFT                   9                                                   /*!< SIM_SRSID: LOCKUP Position              */
#define SIM_SRSID_SW_MASK                        (0x01UL << SIM_SRSID_SW_SHIFT)                      /*!< SIM_SRSID: SW Mask                      */
#define SIM_SRSID_SW_SHIFT                       10                                                  /*!< SIM_SRSID: SW Position                  */
#define SIM_SRSID_MDMAP_MASK                     (0x01UL << SIM_SRSID_MDMAP_SHIFT)                   /*!< SIM_SRSID: MDMAP Mask                   */
#define SIM_SRSID_MDMAP_SHIFT                    11                                                  /*!< SIM_SRSID: MDMAP Position               */
#define SIM_SRSID_SACKERR_MASK                   (0x01UL << SIM_SRSID_SACKERR_SHIFT)                 /*!< SIM_SRSID: SACKERR Mask                 */
#define SIM_SRSID_SACKERR_SHIFT                  13                                                  /*!< SIM_SRSID: SACKERR Position             */
#define SIM_SRSID_PINID_MASK                     (0x0FUL << SIM_SRSID_PINID_SHIFT)                   /*!< SIM_SRSID: PINID Mask                   */
#define SIM_SRSID_PINID_SHIFT                    16                                                  /*!< SIM_SRSID: PINID Position               */
#define SIM_SRSID_PINID(x)                       (((uint32_t)(((uint32_t)(x))<<SIM_SRSID_PINID_SHIFT))&SIM_SRSID_PINID_MASK) /*!< SIM_SRSID                               */
#define SIM_SRSID_REVID_MASK                     (0x0FUL << SIM_SRSID_REVID_SHIFT)                   /*!< SIM_SRSID: REVID Mask                   */
#define SIM_SRSID_REVID_SHIFT                    20                                                  /*!< SIM_SRSID: REVID Position               */
#define SIM_SRSID_REVID(x)                       (((uint32_t)(((uint32_t)(x))<<SIM_SRSID_REVID_SHIFT))&SIM_SRSID_REVID_MASK) /*!< SIM_SRSID                               */
#define SIM_SRSID_SUBFAMID_MASK                  (0x0FUL << SIM_SRSID_SUBFAMID_SHIFT)                /*!< SIM_SRSID: SUBFAMID Mask                */
#define SIM_SRSID_SUBFAMID_SHIFT                 24                                                  /*!< SIM_SRSID: SUBFAMID Position            */
#define SIM_SRSID_SUBFAMID(x)                    (((uint32_t)(((uint32_t)(x))<<SIM_SRSID_SUBFAMID_SHIFT))&SIM_SRSID_SUBFAMID_MASK) /*!< SIM_SRSID                               */
#define SIM_SRSID_FAMID_MASK                     (0x0FUL << SIM_SRSID_FAMID_SHIFT)                   /*!< SIM_SRSID: FAMID Mask                   */
#define SIM_SRSID_FAMID_SHIFT                    28                                                  /*!< SIM_SRSID: FAMID Position               */
#define SIM_SRSID_FAMID(x)                       (((uint32_t)(((uint32_t)(x))<<SIM_SRSID_FAMID_SHIFT))&SIM_SRSID_FAMID_MASK) /*!< SIM_SRSID                               */
/* ------- SOPT Bit Fields                          ------ */
#define SIM_SOPT_NMIE_MASK                       (0x01UL << SIM_SOPT_NMIE_SHIFT)                     /*!< SIM_SOPT: NMIE Mask                     */
#define SIM_SOPT_NMIE_SHIFT                      1                                                   /*!< SIM_SOPT: NMIE Position                 */
#define SIM_SOPT_RSTPE_MASK                      (0x01UL << SIM_SOPT_RSTPE_SHIFT)                    /*!< SIM_SOPT: RSTPE Mask                    */
#define SIM_SOPT_RSTPE_SHIFT                     2                                                   /*!< SIM_SOPT: RSTPE Position                */
#define SIM_SOPT_SWDE_MASK                       (0x01UL << SIM_SOPT_SWDE_SHIFT)                     /*!< SIM_SOPT: SWDE Mask                     */
#define SIM_SOPT_SWDE_SHIFT                      3                                                   /*!< SIM_SOPT: SWDE Position                 */
#define SIM_SOPT_ADHWT_MASK                      (0x03UL << SIM_SOPT_ADHWT_SHIFT)                    /*!< SIM_SOPT: ADHWT Mask                    */
#define SIM_SOPT_ADHWT_SHIFT                     8                                                   /*!< SIM_SOPT: ADHWT Position                */
#define SIM_SOPT_ADHWT(x)                        (((uint32_t)(((uint32_t)(x))<<SIM_SOPT_ADHWT_SHIFT))&SIM_SOPT_ADHWT_MASK) /*!< SIM_SOPT                                */
#define SIM_SOPT_RTCC_MASK                       (0x01UL << SIM_SOPT_RTCC_SHIFT)                     /*!< SIM_SOPT: RTCC Mask                     */
#define SIM_SOPT_RTCC_SHIFT                      10                                                  /*!< SIM_SOPT: RTCC Position                 */
#define SIM_SOPT_ACIC_MASK                       (0x01UL << SIM_SOPT_ACIC_SHIFT)                     /*!< SIM_SOPT: ACIC Mask                     */
#define SIM_SOPT_ACIC_SHIFT                      11                                                  /*!< SIM_SOPT: ACIC Position                 */
#define SIM_SOPT_RXDCE_MASK                      (0x01UL << SIM_SOPT_RXDCE_SHIFT)                    /*!< SIM_SOPT: RXDCE Mask                    */
#define SIM_SOPT_RXDCE_SHIFT                     12                                                  /*!< SIM_SOPT: RXDCE Position                */
#define SIM_SOPT_RXDFE_MASK                      (0x01UL << SIM_SOPT_RXDFE_SHIFT)                    /*!< SIM_SOPT: RXDFE Mask                    */
#define SIM_SOPT_RXDFE_SHIFT                     13                                                  /*!< SIM_SOPT: RXDFE Position                */
#define SIM_SOPT_FTMSYNC_MASK                    (0x01UL << SIM_SOPT_FTMSYNC_SHIFT)                  /*!< SIM_SOPT: FTMSYNC Mask                  */
#define SIM_SOPT_FTMSYNC_SHIFT                   14                                                  /*!< SIM_SOPT: FTMSYNC Position              */
#define SIM_SOPT_TXDME_MASK                      (0x01UL << SIM_SOPT_TXDME_SHIFT)                    /*!< SIM_SOPT: TXDME Mask                    */
#define SIM_SOPT_TXDME_SHIFT                     15                                                  /*!< SIM_SOPT: TXDME Position                */
#define SIM_SOPT_BUSREF_MASK                     (0x07UL << SIM_SOPT_BUSREF_SHIFT)                   /*!< SIM_SOPT: BUSREF Mask                   */
#define SIM_SOPT_BUSREF_SHIFT                    16                                                  /*!< SIM_SOPT: BUSREF Position               */
#define SIM_SOPT_BUSREF(x)                       (((uint32_t)(((uint32_t)(x))<<SIM_SOPT_BUSREF_SHIFT))&SIM_SOPT_BUSREF_MASK) /*!< SIM_SOPT                                */
#define SIM_SOPT_CLKOE_MASK                      (0x01UL << SIM_SOPT_CLKOE_SHIFT)                    /*!< SIM_SOPT: CLKOE Mask                    */
#define SIM_SOPT_CLKOE_SHIFT                     19                                                  /*!< SIM_SOPT: CLKOE Position                */
#define SIM_SOPT_DLYACT_MASK                     (0x01UL << SIM_SOPT_DLYACT_SHIFT)                   /*!< SIM_SOPT: DLYACT Mask                   */
#define SIM_SOPT_DLYACT_SHIFT                    23                                                  /*!< SIM_SOPT: DLYACT Position               */
#define SIM_SOPT_DELAY_MASK                      (0xFFUL << SIM_SOPT_DELAY_SHIFT)                    /*!< SIM_SOPT: DELAY Mask                    */
#define SIM_SOPT_DELAY_SHIFT                     24                                                  /*!< SIM_SOPT: DELAY Position                */
#define SIM_SOPT_DELAY(x)                        (((uint32_t)(((uint32_t)(x))<<SIM_SOPT_DELAY_SHIFT))&SIM_SOPT_DELAY_MASK) /*!< SIM_SOPT                                */
/* ------- PINSEL Bit Fields                        ------ */
#define SIM_PINSEL_RTCPS_MASK                    (0x01UL << SIM_PINSEL_RTCPS_SHIFT)                  /*!< SIM_PINSEL: RTCPS Mask                  */
#define SIM_PINSEL_RTCPS_SHIFT                   4                                                   /*!< SIM_PINSEL: RTCPS Position              */
#define SIM_PINSEL_I2C0PS_MASK                   (0x01UL << SIM_PINSEL_I2C0PS_SHIFT)                 /*!< SIM_PINSEL: I2C0PS Mask                 */
#define SIM_PINSEL_I2C0PS_SHIFT                  5                                                   /*!< SIM_PINSEL: I2C0PS Position             */
#define SIM_PINSEL_SPI0PS_MASK                   (0x01UL << SIM_PINSEL_SPI0PS_SHIFT)                 /*!< SIM_PINSEL: SPI0PS Mask                 */
#define SIM_PINSEL_SPI0PS_SHIFT                  6                                                   /*!< SIM_PINSEL: SPI0PS Position             */
#define SIM_PINSEL_UART0PS_MASK                  (0x01UL << SIM_PINSEL_UART0PS_SHIFT)                /*!< SIM_PINSEL: UART0PS Mask                */
#define SIM_PINSEL_UART0PS_SHIFT                 7                                                   /*!< SIM_PINSEL: UART0PS Position            */
#define SIM_PINSEL_FTM0PS0_MASK                  (0x01UL << SIM_PINSEL_FTM0PS0_SHIFT)                /*!< SIM_PINSEL: FTM0PS0 Mask                */
#define SIM_PINSEL_FTM0PS0_SHIFT                 8                                                   /*!< SIM_PINSEL: FTM0PS0 Position            */
#define SIM_PINSEL_FTM0PS1_MASK                  (0x01UL << SIM_PINSEL_FTM0PS1_SHIFT)                /*!< SIM_PINSEL: FTM0PS1 Mask                */
#define SIM_PINSEL_FTM0PS1_SHIFT                 9                                                   /*!< SIM_PINSEL: FTM0PS1 Position            */
#define SIM_PINSEL_FTM1PS0_MASK                  (0x01UL << SIM_PINSEL_FTM1PS0_SHIFT)                /*!< SIM_PINSEL: FTM1PS0 Mask                */
#define SIM_PINSEL_FTM1PS0_SHIFT                 10                                                  /*!< SIM_PINSEL: FTM1PS0 Position            */
#define SIM_PINSEL_FTM1PS1_MASK                  (0x01UL << SIM_PINSEL_FTM1PS1_SHIFT)                /*!< SIM_PINSEL: FTM1PS1 Mask                */
#define SIM_PINSEL_FTM1PS1_SHIFT                 11                                                  /*!< SIM_PINSEL: FTM1PS1 Position            */
#define SIM_PINSEL_FTM2PS0_MASK                  (0x01UL << SIM_PINSEL_FTM2PS0_SHIFT)                /*!< SIM_PINSEL: FTM2PS0 Mask                */
#define SIM_PINSEL_FTM2PS0_SHIFT                 12                                                  /*!< SIM_PINSEL: FTM2PS0 Position            */
#define SIM_PINSEL_FTM2PS1_MASK                  (0x01UL << SIM_PINSEL_FTM2PS1_SHIFT)                /*!< SIM_PINSEL: FTM2PS1 Mask                */
#define SIM_PINSEL_FTM2PS1_SHIFT                 13                                                  /*!< SIM_PINSEL: FTM2PS1 Position            */
#define SIM_PINSEL_FTM2PS2_MASK                  (0x01UL << SIM_PINSEL_FTM2PS2_SHIFT)                /*!< SIM_PINSEL: FTM2PS2 Mask                */
#define SIM_PINSEL_FTM2PS2_SHIFT                 14                                                  /*!< SIM_PINSEL: FTM2PS2 Position            */
#define SIM_PINSEL_FTM2PS3_MASK                  (0x01UL << SIM_PINSEL_FTM2PS3_SHIFT)                /*!< SIM_PINSEL: FTM2PS3 Mask                */
#define SIM_PINSEL_FTM2PS3_SHIFT                 15                                                  /*!< SIM_PINSEL: FTM2PS3 Position            */
/* ------- SCGC Bit Fields                          ------ */
#define SIM_SCGC_RTC_MASK                        (0x01UL << SIM_SCGC_RTC_SHIFT)                      /*!< SIM_SCGC: RTC Mask                      */
#define SIM_SCGC_RTC_SHIFT                       0                                                   /*!< SIM_SCGC: RTC Position                  */
#define SIM_SCGC_PIT_MASK                        (0x01UL << SIM_SCGC_PIT_SHIFT)                      /*!< SIM_SCGC: PIT Mask                      */
#define SIM_SCGC_PIT_SHIFT                       1                                                   /*!< SIM_SCGC: PIT Position                  */
#define SIM_SCGC_FTM0_MASK                       (0x01UL << SIM_SCGC_FTM0_SHIFT)                     /*!< SIM_SCGC: FTM0 Mask                     */
#define SIM_SCGC_FTM0_SHIFT                      5                                                   /*!< SIM_SCGC: FTM0 Position                 */
#define SIM_SCGC_FTM1_MASK                       (0x01UL << SIM_SCGC_FTM1_SHIFT)                     /*!< SIM_SCGC: FTM1 Mask                     */
#define SIM_SCGC_FTM1_SHIFT                      6                                                   /*!< SIM_SCGC: FTM1 Position                 */
#define SIM_SCGC_FTM2_MASK                       (0x01UL << SIM_SCGC_FTM2_SHIFT)                     /*!< SIM_SCGC: FTM2 Mask                     */
#define SIM_SCGC_FTM2_SHIFT                      7                                                   /*!< SIM_SCGC: FTM2 Position                 */
#define SIM_SCGC_CRC_MASK                        (0x01UL << SIM_SCGC_CRC_SHIFT)                      /*!< SIM_SCGC: CRC Mask                      */
#define SIM_SCGC_CRC_SHIFT                       10                                                  /*!< SIM_SCGC: CRC Position                  */
#define SIM_SCGC_FLASH_MASK                      (0x01UL << SIM_SCGC_FLASH_SHIFT)                    /*!< SIM_SCGC: FLASH Mask                    */
#define SIM_SCGC_FLASH_SHIFT                     12                                                  /*!< SIM_SCGC: FLASH Position                */
#define SIM_SCGC_SWD_MASK                        (0x01UL << SIM_SCGC_SWD_SHIFT)                      /*!< SIM_SCGC: SWD Mask                      */
#define SIM_SCGC_SWD_SHIFT                       13                                                  /*!< SIM_SCGC: SWD Position                  */
#define SIM_SCGC_I2C_MASK                        (0x01UL << SIM_SCGC_I2C_SHIFT)                      /*!< SIM_SCGC: I2C Mask                      */
#define SIM_SCGC_I2C_SHIFT                       17                                                  /*!< SIM_SCGC: I2C Position                  */
#define SIM_SCGC_SPI0_MASK                       (0x01UL << SIM_SCGC_SPI0_SHIFT)                     /*!< SIM_SCGC: SPI0 Mask                     */
#define SIM_SCGC_SPI0_SHIFT                      18                                                  /*!< SIM_SCGC: SPI0 Position                 */
#define SIM_SCGC_SPI1_MASK                       (0x01UL << SIM_SCGC_SPI1_SHIFT)                     /*!< SIM_SCGC: SPI1 Mask                     */
#define SIM_SCGC_SPI1_SHIFT                      19                                                  /*!< SIM_SCGC: SPI1 Position                 */
#define SIM_SCGC_UART0_MASK                      (0x01UL << SIM_SCGC_UART0_SHIFT)                    /*!< SIM_SCGC: UART0 Mask                    */
#define SIM_SCGC_UART0_SHIFT                     20                                                  /*!< SIM_SCGC: UART0 Position                */
#define SIM_SCGC_UART1_MASK                      (0x01UL << SIM_SCGC_UART1_SHIFT)                    /*!< SIM_SCGC: UART1 Mask                    */
#define SIM_SCGC_UART1_SHIFT                     21                                                  /*!< SIM_SCGC: UART1 Position                */
#define SIM_SCGC_UART2_MASK                      (0x01UL << SIM_SCGC_UART2_SHIFT)                    /*!< SIM_SCGC: UART2 Mask                    */
#define SIM_SCGC_UART2_SHIFT                     22                                                  /*!< SIM_SCGC: UART2 Position                */
#define SIM_SCGC_KBI0_MASK                       (0x01UL << SIM_SCGC_KBI0_SHIFT)                     /*!< SIM_SCGC: KBI0 Mask                     */
#define SIM_SCGC_KBI0_SHIFT                      24                                                  /*!< SIM_SCGC: KBI0 Position                 */
#define SIM_SCGC_KBI1_MASK                       (0x01UL << SIM_SCGC_KBI1_SHIFT)                     /*!< SIM_SCGC: KBI1 Mask                     */
#define SIM_SCGC_KBI1_SHIFT                      25                                                  /*!< SIM_SCGC: KBI1 Position                 */
#define SIM_SCGC_IRQ_MASK                        (0x01UL << SIM_SCGC_IRQ_SHIFT)                      /*!< SIM_SCGC: IRQ Mask                      */
#define SIM_SCGC_IRQ_SHIFT                       27                                                  /*!< SIM_SCGC: IRQ Position                  */
#define SIM_SCGC_ADC_MASK                        (0x01UL << SIM_SCGC_ADC_SHIFT)                      /*!< SIM_SCGC: ADC Mask                      */
#define SIM_SCGC_ADC_SHIFT                       29                                                  /*!< SIM_SCGC: ADC Position                  */
#define SIM_SCGC_ACMP0_MASK                      (0x01UL << SIM_SCGC_ACMP0_SHIFT)                    /*!< SIM_SCGC: ACMP0 Mask                    */
#define SIM_SCGC_ACMP0_SHIFT                     30                                                  /*!< SIM_SCGC: ACMP0 Position                */
#define SIM_SCGC_ACMP1_MASK                      (0x01UL << SIM_SCGC_ACMP1_SHIFT)                    /*!< SIM_SCGC: ACMP1 Mask                    */
#define SIM_SCGC_ACMP1_SHIFT                     31                                                  /*!< SIM_SCGC: ACMP1 Position                */
/* ------- UUIDL Bit Fields                         ------ */
/* ------- UUIDH Bit Fields                         ------ */
/* ------- BUSDIV Bit Fields                        ------ */
#define SIM_BUSDIV_BUSDIV_MASK                   (0x01UL << SIM_BUSDIV_BUSDIV_SHIFT)                 /*!< SIM_BUSDIV: BUSDIV Mask                 */
#define SIM_BUSDIV_BUSDIV_SHIFT                  0                                                   /*!< SIM_BUSDIV: BUSDIV Position             */
/**
 * @} */ /* End group SIM_Register_Masks_GROUP 
 */

/* SIM - Peripheral instance base addresses */
#define SIM_BasePtr                    0x40048000UL //!< Peripheral base address
#define SIM                            ((SIM_Type *) SIM_BasePtr) //!< Freescale base pointer
#define SIM_BASE_PTR                   (SIM) //!< Freescale style base pointer
/**
 * @} */ /* End group SIM_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup SPI_Peripheral_access_layer_GROUP SPI Peripheral Access Layer
* @brief C Struct for SPI
* @{
*/

/* ================================================================================ */
/* ================           SPI0 (file:SPI0_MKE)                 ================ */
/* ================================================================================ */

/**
 * @brief Serial Peripheral Interface
 */
/**
* @addtogroup SPI_structs_GROUP SPI struct
* @brief Struct for SPI
* @{
*/
typedef struct {                                /*       SPI0 Structure                                               */
   __IO uint8_t   C1;                           /**< 0000: Control register 1                                           */
   __IO uint8_t   C2;                           /**< 0001: Control register 2                                           */
   __IO uint8_t   BR;                           /**< 0002: SPI baud rate register BAUD = (Bus Clock)/Prescaler/Baud Rate Divisor */
   __I  uint8_t   S;                            /**< 0003: Status register                                              */
   __I  uint8_t   RESERVED0;                   
   __IO uint8_t   D;                            /**< 0005: Data register                                                */
   __I  uint8_t   RESERVED1;                   
   __IO uint8_t   M;                            /**< 0007: Match register:                                              */
} SPI_Type;

/**
 * @} */ /* End group SPI_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'SPI0' Position & Mask macros                        ----------- */
/* -------------------------------------------------------------------------------- */

